app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(comment_params)
    @comment.user_id = current_user.id
    if @comment.save
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = NULL LIMIT 1
INSERT INTO `comments` (`content`, `user_id`, `post_id`, `created_at`, `updated_at`) VALUES ('すごい布団ですね！', 2, 1, '2021-02-10 15:31:16', '2021-02-10 15:31:16')