app/controllers/pages_controller.rb

SELECT  `users`.* FROM `users` LIMIT 1
---
  def index
    @users = User.all

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `posts`.* FROM `posts`
---
  def show
    @user = User.find(params[:id])
    @posts = Post.all