app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`user_id`, `video`, `content`, `created_at`, `updated_at`) VALUES (1, 'test__convert-video-online.com_.mp4', 'test01', '2021-01-02 08:57:12', '2021-01-02 08:57:12')

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE `posts` SET `content` = 'test', `updated_at` = '2021-01-14 14:16:10' WHERE `posts`.`id` = 2